## Solution 1

In [2]:
import pandas as pd

In [3]:
#.read_csv() -->  Read the File 
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [4]:
#.head() ->  Get First 5 Rows
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
#.tail()  --> Get Last 5 Rows
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [6]:
# .dtypes --> Get the dataype of each column
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [7]:
# .columns --> Get the name of the column
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

## Solution 2

In [8]:
import pandas as pd

In [9]:
data = {'A':[3,8,6,8,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]}

In [10]:
df = pd.DataFrame(data)

In [11]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  8  3  5
4  9  1  2

In [12]:
def reindexing(df):
    return [i for i in range(1,len(df)*2,2)]

df.index = reindexing(df)

In [13]:
df

   A  B  C
1  3  5  1
3  8  2  7
5  6  9  4
7  8  3  5
9  9  1  2

## Solution 3

In [17]:
import pandas as pd

In [18]:
data = {'values':[10,20,30,40,50]}

In [19]:
df = pd.DataFrame(data)

In [20]:
df

   values
0      10
1      20
2      30
3      40
4      50

In [23]:
def get_sum(df):
    return df.loc[0:2,['values']].sum()

result = get_sum(df)

print(result)

values    60
dtype: int64

## Solution 4

In [27]:
import pandas as pd

In [28]:
data = {'Text':['python','C','java','pandas','ash']}

In [29]:
df = pd.DataFrame(data)

In [30]:
def get_wordcount(df):
    return [len(df._get_value(i,'Text')) for i in range(len(df))]

df['Word_Count'] = get_wordcount(df)

In [31]:
df

     Text  Word_Count
0  python           6
1       C           1
2    java           4
3  pandas           6
4     ash           3

## Solution 5

DataFrame.size():
The size property returns the number of elements in the DataFrame. The number of elements is the number of rows * the number of columns.

DataFrame.shape():
The shape of a DataFrame is a tuple of array dimensions that tells the number of rows and columns of a given DataFrame.

In [32]:
# example
# Dataframe.size()
df.size #prints --> rows * column

10

In [33]:
df.shape #prints --> tuple(rows,column)

(5, 2)

## Solution 6

In [34]:
import pandas as pd

In [35]:
df = pd.read_excel('LUSID Excel - Setting up your market data.xlsx') #this is the function to read excel
df.head(3)      # to print first 3 rows

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,Datetimes in LUSID,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## Solution 7

In [37]:
import pandas as pd

In [38]:
data = {'Email':['username@domain.com','username1@domain.com','username2@domain.com']}

In [39]:
df = pd.DataFrame(data)

In [40]:
df

                  Email
0   username@domain.com
1  username1@domain.com
2  username2@domain.com

In [41]:
def get_username(df):
    return [df._get_value(i,'Email').split("@")[0] for i in range(len(df))]

df['Username'] = get_username(df)

In [10]:
df

                  Email   Username
0   username@domain.com   username
1  username1@domain.com  username1
2  username2@domain.com  username2

## Solution 8

In [42]:
import pandas as pd

data = {'A':[3,8,6,8,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]}

In [43]:
df = pd.DataFrame(data)

In [44]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  8  3  5
4  9  1  2

In [45]:
def newframe(df):
    return df[(df['A'] > 5) & (df['B'] < 10)]

newframe(df)

   A  B  C
1  8  2  7
2  6  9  4
3  8  3  5
4  9  1  2

## Solution 9

In [48]:
import pandas as pd

data = {'values':[10,20,30,40,50]}

df = pd.DataFrame(data)

In [49]:
def get_values(df):
    return df[['values']].median(),df[['values']].mean(),df[['values']].std()

In [53]:
result = get_values(df)

print("Median -->" ,result[0])
print("Mean -->" ,result[1])
print("Standard devaition -->", result[2])

Median --> values    30.0
dtype: float64
Mean --> values    30.0
dtype: float64
Standard devaition --> values    15.811388
dtype: float64

In [54]:
df.describe()    # get all the values together

          values
count   5.000000
mean   30.000000
std    15.811388
min    10.000000
25%    20.000000
50%    30.000000
75%    40.000000
max    50.000000

## Solution 10

In [55]:
import pandas as pd

sales_data = [100, 200, 300, 400, 500, 600, 700, 800, 900, 1000, 1100, 1200]

date_strings = ['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04', '2022-01-05',
                '2022-01-06', '2022-01-07', '2022-01-08', '2022-01-09', '2022-01-10',
                '2022-01-11', '2022-01-12']

dates = pd.to_datetime(date_strings)

In [56]:
df = pd.DataFrame({'Sales': sales_data, 'Date': dates})

In [61]:
def get_mvavg(df):
    return df['Sales'].rolling(window=7).mean()

In [62]:
df['MA 7'] = get_mvavg(df)

In [63]:
print(df)

    Sales       Date   MA 7
0     100 2022-01-01    NaN
1     200 2022-01-02    NaN
2     300 2022-01-03    NaN
3     400 2022-01-04    NaN
4     500 2022-01-05    NaN
5     600 2022-01-06    NaN
6     700 2022-01-07  400.0
7     800 2022-01-08  500.0
8     900 2022-01-09  600.0
9    1000 2022-01-10  700.0
10   1100 2022-01-11  800.0
11   1200 2022-01-12  900.0

## Solution 11

In [64]:
import pandas as pd

In [65]:
data = {'date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']}

In [66]:
df = pd.DataFrame(data)

In [67]:
df

         date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [68]:
def get_weekday(df):
    return [pd.Timestamp(df._get_value(i,'date')).day_name() for i in range(len(df))]
df['Weekday'] = get_weekday(df)

In [69]:
df

         date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

## Solution 12

In [78]:
import pandas as pd

In [79]:
data = {'date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05','2023-02-17','2023-05-05']}

In [80]:
df = pd.DataFrame(data)

In [81]:
def select_rows_between_dates(df):
    selected_rows = df[(df['date'] > '2023-01-01') & (df['date'] < '2023-01-31')]
    return selected_rows

In [83]:
print(select_rows_between_dates(df))

         date
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

## Solution 13

To use the basic functions of pandas,the first and foremost necessary library that needs to
be imported is "pandas module"

#example
Syntax --> import pandas as pd

## THE END